; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v11 ?v3)
             (pred_8 ?v6 ?v1)
             (pred_3 ?v11 ?v1)
             (pred_5 ?v2 ?v11 )
	     (pred_12 ?v11)
             (pred_11 ?v12)
             (pred_4 ?v6)
             (pred_7 ?v1)
             (pred_6 ?v11)
             (pred_9 ?v6)
             (pred_10 ?v11)
             (pred_1 ))



(:action op_4
:parameters (?v8 ?v13 ?v9 ?v10)
:precondition (and (pred_11 ?v8) (pred_11 ?v13) (pred_4 ?v9) (pred_7 ?v10)
          (pred_2 ?v8 ?v13) (pred_8 ?v9 ?v10)
                   (pred_3 ?v13 ?v10) (pred_12 ?v8) 
                   (pred_6 ?v13) (pred_9 ?v9))
:effect (and  (pred_10 ?v13) (not (pred_6 ?v13))))


(:action op_3
:parameters (?v8 ?v5)
:precondition (and (pred_11 ?v8) (pred_11 ?v5)
               (pred_12 ?v8) (pred_2 ?v8 ?v5) (pred_10 ?v5))
:effect (and (pred_12 ?v5) (not (pred_12 ?v8))))

(:action op_5
:parameters (?v8 ?v9)
:precondition (and (pred_11 ?v8) (pred_4 ?v9) 
                  (pred_12 ?v8) (pred_5 ?v9 ?v8) (pred_1 ))
:effect (and (pred_9 ?v9)
   (not (pred_5 ?v9 ?v8)) (not (pred_1 ))))


(:action op_2
:parameters (?v8 ?v7 ?v4)
:precondition (and (pred_11 ?v8) (pred_4 ?v7) (pred_4 ?v4)
                  (pred_12 ?v8) (pred_9 ?v4) (pred_5 ?v7 ?v8))
:effect (and (pred_9 ?v7) (pred_5 ?v4 ?v8)
        (not (pred_9 ?v4)) (not (pred_5 ?v7 ?v8))))

(:action op_1
:parameters (?v8 ?v9)
:precondition (and (pred_11 ?v8) (pred_4 ?v9) 
                  (pred_12 ?v8) (pred_9 ?v9))
:effect (and (pred_1 ) (pred_5 ?v9 ?v8) (not (pred_9 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_10 obj_21 obj_17 obj_11 obj_12 obj_09 obj_16 obj_03 obj_19 obj_08 obj_06 obj_20 obj_18 obj_13 obj_05
    obj_01 obj_02 obj_15
    obj_22 obj_07 obj_04
    )

    (:init
       (pred_1)

       (pred_11 obj_14)
       (pred_11 obj_10)
       (pred_11 obj_21)
       (pred_11 obj_17)
       (pred_11 obj_11)
       (pred_11 obj_12)
       (pred_11 obj_09)
       (pred_11 obj_16)
       (pred_11 obj_03)
       (pred_11 obj_19)
       (pred_11 obj_08)
       (pred_11 obj_06)
       (pred_11 obj_20)
       (pred_11 obj_18)
       (pred_11 obj_13)
       (pred_11 obj_05)
       (pred_7 obj_01)
       (pred_7 obj_02)
       (pred_7 obj_15)
       (pred_4 obj_22)
       (pred_4 obj_07)
       (pred_4 obj_04)

       (pred_2 obj_14 obj_11)
       (pred_2 obj_14 obj_10)
       (pred_2 obj_10 obj_12)
       (pred_2 obj_10 obj_21)
       (pred_2 obj_10 obj_14)
       (pred_2 obj_21 obj_09)
       (pred_2 obj_21 obj_17)
       (pred_2 obj_21 obj_10)
       (pred_2 obj_17 obj_16)
       (pred_2 obj_17 obj_21)
       (pred_2 obj_11 obj_03)
       (pred_2 obj_11 obj_12)
       (pred_2 obj_11 obj_14)
       (pred_2 obj_12 obj_19)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_12 obj_10)
       (pred_2 obj_12 obj_11)
       (pred_2 obj_09 obj_08)
       (pred_2 obj_09 obj_16)
       (pred_2 obj_09 obj_21)
       (pred_2 obj_09 obj_12)
       (pred_2 obj_16 obj_06)
       (pred_2 obj_16 obj_17)
       (pred_2 obj_16 obj_09)
       (pred_2 obj_03 obj_20)
       (pred_2 obj_03 obj_19)
       (pred_2 obj_03 obj_11)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_19 obj_08)
       (pred_2 obj_19 obj_12)
       (pred_2 obj_19 obj_03)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_08 obj_06)
       (pred_2 obj_08 obj_09)
       (pred_2 obj_08 obj_19)
       (pred_2 obj_06 obj_05)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_06 obj_08)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_20 obj_03)
       (pred_2 obj_18 obj_13)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_13 obj_18)
       (pred_2 obj_05 obj_06)
       (pred_2 obj_05 obj_13)
       (pred_6 obj_05)
       (pred_6 obj_16)
       (pred_6 obj_06)
       (pred_3  obj_05 obj_01)
       (pred_3  obj_16 obj_02)
       (pred_3  obj_06 obj_15)
       (pred_10 obj_14)
       (pred_10 obj_10)
       (pred_10 obj_21)
       (pred_10 obj_17)
       (pred_10 obj_11)
       (pred_10 obj_12)
       (pred_10 obj_09)
       (pred_10 obj_03)
       (pred_10 obj_19)
       (pred_10 obj_08)
       (pred_10 obj_20)
       (pred_10 obj_18)
       (pred_10 obj_13)

       (pred_8  obj_22 obj_01)
       (pred_8  obj_07 obj_02)
       (pred_8  obj_04 obj_15)
       (pred_5 obj_22 obj_17)
       (pred_5 obj_07 obj_12)
       (pred_5 obj_04 obj_10)
       (pred_12 obj_20)
    )

    (:goal (and
       (pred_5 obj_07 obj_19)
       (pred_5 obj_04 obj_11)
    ))
(:constraints
  (always (not (pred_12 obj_03)))
)
)

; plan
1. (op_3 obj_20 obj_18)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_18)
   goals met: 0 of 2
2. (op_3 obj_18 obj_19)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_19)
   goals met: 0 of 2
3. (op_3 obj_19 obj_12)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_12)
   goals met: 0 of 2
4. (op_5 obj_12 obj_07)
   deleted: (pred_5 obj_07 obj_12) (pred_1)
   added: (pred_9 obj_07)
   goals met: 0 of 2
5. (op_3 obj_12 obj_19)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_19)
   goals met: 0 of 2
6. (op_1 obj_19 obj_07)
   deleted: (pred_9 obj_07)
   added: (pred_1) (pred_5 obj_07 obj_19)
   goals met: 1 of 2
7. (op_3 obj_19 obj_12)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_12)
   goals met: 1 of 2
8. (op_3 obj_12 obj_10)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_10)
   goals met: 1 of 2
9. (op_5 obj_10 obj_04)
   deleted: (pred_5 obj_04 obj_10) (pred_1)
   added: (pred_9 obj_04)
   goals met: 1 of 2
10. (op_3 obj_10 obj_14)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_14)
   goals met: 1 of 2
11. (op_3 obj_14 obj_11)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_11)
   goals met: 1 of 2
12. (op_1 obj_11 obj_04)
   deleted: (pred_9 obj_04)
   added: (pred_1) (pred_5 obj_04 obj_11)
   goals met: 2 of 2
